CPS-Projet/spec/html/bloc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>bloc</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-17 12:32:13 CET"/>
<meta name="author" content="COQUART KEVIN"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">bloc</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Bloc </a>
<ul>
<li><a href="#sec-1.1">1.1 service : Bloc </a></li>
<li><a href="#sec-1.2">1.2 use : Objet </a></li>
<li><a href="#sec-1.3">1.3 types : int, boolean, enum TYPE<sub>Bloc</sub> {VIDE, FOSSE}, enum TYPE<sub>Tresor</sub> {RIEN, DIXDOLLAR, CINQDOLLAR, CHAINEVELO, POUBELLEMETALLIQUE} </a></li>
<li><a href="#sec-1.4">1.4 observators : </a></li>
<li><a href="#sec-1.5">1.5 Constructors : </a></li>
<li><a href="#sec-1.6">1.6 Operators : </a></li>
<li><a href="#sec-1.7">1.7 Observations : </a>
<ul>
<li><a href="#sec-1.7.1">1.7.1 [invariants] </a></li>
<li><a href="#sec-1.7.2">1.7.2 [init] </a></li>
<li><a href="#sec-1.7.3">1.7.3 [ramasser-tresor] </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Bloc </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> service : Bloc </h3>
<div class="outline-text-3" id="text-1.1">

</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> use : Objet </h3>
<div class="outline-text-3" id="text-1.2">

</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> types : int, boolean, enum TYPE<sub>Bloc</sub> {VIDE, FOSSE}, enum TYPE<sub>Tresor</sub> {RIEN, DIXDOLLAR, CINQDOLLAR, CHAINEVELO, POUBELLEMETALLIQUE} </h3>
<div class="outline-text-3" id="text-1.3">


</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> observators : </h3>
<div class="outline-text-3" id="text-1.4">

<ul>
<li id="sec-1.4.1">const largeur : → int <br/>
</li>
<li id="sec-1.4.2">const hauteur : → int <br/>
</li>
<li id="sec-1.4.3">const profondeur : → int <br/>
</li>
<li id="sec-1.4.4">const typeBloc : [Bloc]  → TYPE<sub>Bloc</sub> <br/>
</li>
<li id="sec-1.4.5">aTresor : [Bloc]  → boolean <br/>
</li>
<li id="sec-1.4.6">typeTresor : [Bloc]  → TYPE<sub>Tresor</sub> <br/>
<ul>
<li id="sec-1.4.6.1">pre typeTresor(B) require aTresor(B) <br/>

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Constructors : </h3>
<div class="outline-text-3" id="text-1.5">

<ul>
<li id="sec-1.5.1">init : TYPE<sub>Bloc</sub> × TYPE<sub>Tresor</sub> → [Bloc] <br/>
</li>
<li id="sec-1.5.2">init : TYPE<sub>Bloc</sub> → [Bloc] <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Operators : </h3>
<div class="outline-text-3" id="text-1.6">

<ul>
<li id="sec-1.6.1">ramasser-tresor : [Bloc] → Objet <br/>
<ul>
<li id="sec-1.6.1.1">pre ramasser-tresor(B) require aTresor(B) <br/>

</li>
</ul>
</li>
<li id="sec-1.6.2">deposer-tresor : [Bloc] × Objet → [Bloc] <br/>
<ul>
<li id="sec-1.6.2.1">pre deposer-tresor(B,o) require ¬aTresor(B) <br/>


</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7"><span class="section-number-3">1.7</span> Observations : </h3>
<div class="outline-text-3" id="text-1.7">


</div>

<div id="outline-container-1.7.1" class="outline-4">
<h4 id="sec-1.7.1"><span class="section-number-4">1.7.1</span> [invariants] </h4>
<div class="outline-text-4" id="text-1.7.1">

<ul>
<li id="sec-1.7.1.1">aTresor(B) =(min) typeTresor ≠ TYPE<sub>Tresor</sub>.RIEN <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.7.2" class="outline-4">
<h4 id="sec-1.7.2"><span class="section-number-4">1.7.2</span> [init] </h4>
<div class="outline-text-4" id="text-1.7.2">

<ul>
<li id="sec-1.7.2.1">largeur(init(b,t)) = 10 <br/>
</li>
<li id="sec-1.7.2.2">largeur(init(b)) = 10 <br/>

</li>
<li id="sec-1.7.2.3">hauteur(init(b,t)) = 10 <br/>
</li>
<li id="sec-1.7.2.4">hauteur(init(b)) = 10 <br/>

</li>
<li id="sec-1.7.2.5">profondeur(init(b,t)) = 10 <br/>
</li>
<li id="sec-1.7.2.6">profondeur(init(b)) = 10 <br/>

</li>
<li id="sec-1.7.2.7">typeBloc(init(b,t)) = b <br/>
</li>
<li id="sec-1.7.2.8">typeBloc(init(b)) = b <br/>

</li>
<li id="sec-1.7.2.9">typeTresor(init(b,t)) = t <br/>
</li>
<li id="sec-1.7.2.10">typeTresor(init(b)) = TYPE<sub>Tresor</sub>.RIEN <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.7.3" class="outline-4">
<h4 id="sec-1.7.3"><span class="section-number-4">1.7.3</span> [ramasser-tresor] </h4>
<div class="outline-text-4" id="text-1.7.3">

<p>****
</p></div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: COQUART KEVIN
<a href="mailto:3000976@ari-31-303-10.infop6.jussieu.fr">&lt;3000976@ari-31-303-10.infop6.jussieu.fr&gt;</a>
</p>
<p class="date"> Date: 2014-03-17 12:32:13 CET</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
